// ====================================================================================================
// 전역에서 사용될 타입들을 선언해두는 파일
// ====================================================================================================



// ----------------------------------------------------------------------------------------------------
// 기본적으로 사용될 단위 같은 것들
// ----------------------------------------------------------------------------------------------------
type TPosition = {
    x: number|null;
    y: number|null;
};

// 크기
type TSize = {
    width: number|null;
    height: number|null;
};

// ----------------------------------------------------------------------------------------------------
// 마우스 관련
// ----------------------------------------------------------------------------------------------------
// 마우스 입력 종류
type TMouseKeys = "left"|"wheel"|"right";
// 마우스 휠 방향
type IWheelDelta = {
    x: number;  // X 방향 거리
    y: number;  // Y 방향 거리
};
// 마우스 드래그된 거리
type IMouseDraggedSize = {
    [key in TMouseKeys]: Size;
};

// 마우스 클릭 이벤트의 종류
type mouseClickType = "unsure"|"sure"|"cancel";

// ----------------------------------------------------------------------------------------------------
// 기타
// ----------------------------------------------------------------------------------------------------
// 워크스페이스에 저장될 Area들의 형태
interface IWorkspaceArea {
    x:number; // X 좌표 0 ~ 10000 (%값)
    y:number; // Y 좌표 0 ~ 10000 (%값)
    width:number; // 너비 0 ~ 10000 (%값)
    height:number; // 높이 0 ~ 10000 (%값)

    isMinimize:boolean; // 숨김 여부 (기능 구현 예정)
    moduleType:string; // 안에 담길 모듈의 종류
}